In [22]:
import pandas as pd
import numpy as np

In [23]:
data =  {'eng':[10,30,50,70,60],
         'kor':[20,40,60,80,75],
         'math':[90,50,20,70,30]}
df = pd.DataFrame(data, index=['a','b','c','d','e'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

### 인덱싱
- ['부여된컬럼명']
- [ ['컬럼명','컬럼명'] ]

In [24]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [25]:
df['eng'] #.시리즈함수()

a    10
b    30
c    50
d    70
e    60
Name: eng, dtype: int64

In [26]:
df['eng'].sum()

np.int64(220)

In [27]:
sr = df['eng']
sr.sum() #참조변수가 있어 메모리가 계속 살아있음, 데이터양을 많이 잡아먹음

np.int64(220)

In [28]:
df[['eng','kor']] #데이터프레임객체로 출력 .속성메소드 호출

   eng  kor
a   10   20
b   30   40
c   50   60
d   70   80
e   60   75

### 슬라이싱(행단위)
- [시작인덱스:끝인덱스:증가치]
- [부여된인덱스:부여된인덱스]

In [29]:
df[1:4]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [30]:
df['b':'c']

   eng  kor  math
b   30   40    50
c   50   60    20

### iloc : zero base
- [행,열]

In [31]:
df.iloc[0] #0행 출력, 시리즈

eng     10
kor     20
math    90
Name: a, dtype: int64

In [32]:
df.iloc[0,0] #0행0열

np.int64(10)

In [35]:
df.iloc[1,2]

np.int64(50)

In [34]:
df.iloc[[1,3]]

   eng  kor  math
b   30   40    50
d   70   80    70

In [36]:
df.iloc[1:]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [39]:
df.iloc[1:4]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70

In [38]:
df.iloc[1:4, 1:]

   kor  math
b   40    50
c   60    20
d   80    70

In [ ]:
df.iloc[[1,3], [0,2]]

   eng  math
b   30    50
d   70    70

In [19]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [ ]:
### Q)
df.iloc[[1,3,4],[0,2]]
# df.iloc[[1,3,4],::2]

   eng  math
b   30    50
d   70    70
e   60    30

- loc[]: 부여된 인덱스명, 부여된 칼럼명
[행,열]

In [44]:
df.loc['a']

eng     10
kor     20
math    90
Name: a, dtype: int64

In [45]:
df.loc['a','eng']

np.int64(10)

In [ ]:
df.loc['a':'c'] #a행~c행

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [ ]:
df.loc[['a','c']] # a인덱스, c인덱스

   eng  kor  math
a   10   20    90
c   50   60    20

In [49]:
df.loc['a':'c', 'kor':]

   kor  math
a   20    90
b   40    50
c   60    20

In [ ]:
### Q)
df.loc[['b','d','e'], ['eng','math']]

   eng  math
b   30    50
d   70    70
e   60    30

In [ ]:
df.loc[:,'eng'] # df.['eng]

a    10
b    30
c    50
d    70
e    60
Name: eng, dtype: int64

In [46]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30